internquest/app/Http/Controllers/BlogController.php

    public function index() : View{
        return view('blog.index', [
            'posts' => Post::with('tags', 'category')->paginate(10),
        ]);
---
select * from `categories` where `categories`.`id` in (1, 2)
select * from `posts` limit 10 offset 0
select `tags`.*, `post_tag`.`post_id` as `pivot_post_id`, `post_tag`.`tag_id` as `pivot_tag_id` from `tags` inner join `post_tag` on `tags`.`id` = `post_tag`.`tag_id` where `post_tag`.`post_id` in (1, 2, 6, 9)
select count(*) as aggregate from `posts`

    public function edit(Post $post) {
        return view('blog.edit', [
            'post' => $post,
            'categories' => Category::select('id', 'name')->get(),
        ]);
        /*
        Post::find($post->id);
---
select `id`, `name` from `categories`
select * from `posts` where `posts`.`id` = '4' limit 1