internquest/app/Http/Controllers/RegisterController.php

    public function store(RegisterRequest $request){
        $user = User::create($request->validated());
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('fano0905', 'fano.kevin@gmail.com', '$2y$12$CDYIltwJFZx9BPAa4DsNJuI9l1T6nZHXMXaIdtUjXnEbU099XdPtK', '2024-03-19 14:31:33', '2024-03-19 14:31:33')